Revit 2027 API
CableSize.NumberOfHotConductors Property
 The number of Hot Conductors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfHotConductors { get; set; }
Public Property NumberOfHotConductors As Integer
	Get
	Set
public:
property int NumberOfHotConductors {
	int get ();
	void set (int value);
}
member NumberOfHotConductors : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for numberOfHotConductors is negative.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace